01_hello/sinatra-1.4.5/bench_results.txt
Running 2s test @ http://0.0.0.0:9292
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.99ms   25.66ms  75.85ms   70.00%
    Req/Sec   233.20    119.66   406.00     72.86%
  907 requests in 2.00s, 255.03KB read
  Socket errors: connect 0, read 5, write 0, timeout 0
Requests/sec:    453.31
Transfer/sec:    127.46KB